espressif/esp-idf/components/soc/esp32c6/register/soc/sdio_slc_host_reg.h
/** SLCHOST_CONF_W3_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_W3_REG (DR_REG_SLCHOST_BASE + 0x78)
/** SLCHOST_SLCHOST_CONF12 : R/W; bitpos: [7:0]; default: 192;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF12    0x000000FFU
#define SLCHOST_SLCHOST_CONF12_M  (SLCHOST_SLCHOST_CONF12_V << SLCHOST_SLCHOST_CONF12_S)
#define SLCHOST_SLCHOST_CONF12_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF12_S  0
/** SLCHOST_SLCHOST_CONF13 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF13    0x000000FFU
#define SLCHOST_SLCHOST_CONF13_M  (SLCHOST_SLCHOST_CONF13_V << SLCHOST_SLCHOST_CONF13_S)
#define SLCHOST_SLCHOST_CONF13_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF13_S  8
/** SLCHOST_SLCHOST_CONF14 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF14    0x000000FFU
#define SLCHOST_SLCHOST_CONF14_M  (SLCHOST_SLCHOST_CONF14_V << SLCHOST_SLCHOST_CONF14_S)
#define SLCHOST_SLCHOST_CONF14_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF14_S  16
/** SLCHOST_SLCHOST_CONF15 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF15    0x000000FFU
#define SLCHOST_SLCHOST_CONF15_M  (SLCHOST_SLCHOST_CONF15_V << SLCHOST_SLCHOST_CONF15_S)
#define SLCHOST_SLCHOST_CONF15_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF15_S  24

/** SLCHOST_CONF_W4_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_W4_REG (DR_REG_SLCHOST_BASE + 0x7c)
/** SLCHOST_SLCHOST_CONF16 : R/W; bitpos: [7:0]; default: 255;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF16    0x000000FFU
#define SLCHOST_SLCHOST_CONF16_M  (SLCHOST_SLCHOST_CONF16_V << SLCHOST_SLCHOST_CONF16_S)
#define SLCHOST_SLCHOST_CONF16_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF16_S  0
/** SLCHOST_SLCHOST_CONF17 : R/W; bitpos: [15:8]; default: 1;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF17    0x000000FFU
#define SLCHOST_SLCHOST_CONF17_M  (SLCHOST_SLCHOST_CONF17_V << SLCHOST_SLCHOST_CONF17_S)
#define SLCHOST_SLCHOST_CONF17_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF17_S  8
/** SLCHOST_SLCHOST_CONF18 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF18    0x000000FFU
#define SLCHOST_SLCHOST_CONF18_M  (SLCHOST_SLCHOST_CONF18_V << SLCHOST_SLCHOST_CONF18_S)
#define SLCHOST_SLCHOST_CONF18_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF18_S  16
/** SLCHOST_SLCHOST_CONF19 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF19    0x000000FFU
#define SLCHOST_SLCHOST_CONF19_M  (SLCHOST_SLCHOST_CONF19_V << SLCHOST_SLCHOST_CONF19_S)
#define SLCHOST_SLCHOST_CONF19_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF19_S  24

/** SLCHOST_CONF_W5_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_W5_REG (DR_REG_SLCHOST_BASE + 0x80)
/** SLCHOST_SLCHOST_CONF20 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF20    0x000000FFU
#define SLCHOST_SLCHOST_CONF20_M  (SLCHOST_SLCHOST_CONF20_V << SLCHOST_SLCHOST_CONF20_S)
#define SLCHOST_SLCHOST_CONF20_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF20_S  0
/** SLCHOST_SLCHOST_CONF21 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF21    0x000000FFU
#define SLCHOST_SLCHOST_CONF21_M  (SLCHOST_SLCHOST_CONF21_V << SLCHOST_SLCHOST_CONF21_S)
#define SLCHOST_SLCHOST_CONF21_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF21_S  8
/** SLCHOST_SLCHOST_CONF22 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF22    0x000000FFU
#define SLCHOST_SLCHOST_CONF22_M  (SLCHOST_SLCHOST_CONF22_V << SLCHOST_SLCHOST_CONF22_S)
#define SLCHOST_SLCHOST_CONF22_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF22_S  16
/** SLCHOST_SLCHOST_CONF23 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF23    0x000000FFU
#define SLCHOST_SLCHOST_CONF23_M  (SLCHOST_SLCHOST_CONF23_V << SLCHOST_SLCHOST_CONF23_S)
#define SLCHOST_SLCHOST_CONF23_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF23_S  24

/** SLCHOST_WIN_CMD_REG register
 *  *******Description***********
 */
#define SLCHOST_WIN_CMD_REG (DR_REG_SLCHOST_BASE + 0x84)
/** SLCHOST_SLCHOST_WIN_CMD : R/W; bitpos: [15:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_WIN_CMD    0x0000FFFFU
#define SLCHOST_SLCHOST_WIN_CMD_M  (SLCHOST_SLCHOST_WIN_CMD_V << SLCHOST_SLCHOST_WIN_CMD_S)
#define SLCHOST_SLCHOST_WIN_CMD_V  0x0000FFFFU
#define SLCHOST_SLCHOST_WIN_CMD_S  0

/** SLCHOST_CONF_W6_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_W6_REG (DR_REG_SLCHOST_BASE + 0x88)
/** SLCHOST_SLCHOST_CONF24 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF24    0x000000FFU
#define SLCHOST_SLCHOST_CONF24_M  (SLCHOST_SLCHOST_CONF24_V << SLCHOST_SLCHOST_CONF24_S)
#define SLCHOST_SLCHOST_CONF24_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF24_S  0
/** SLCHOST_SLCHOST_CONF25 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF25    0x000000FFU
#define SLCHOST_SLCHOST_CONF25_M  (SLCHOST_SLCHOST_CONF25_V << SLCHOST_SLCHOST_CONF25_S)
#define SLCHOST_SLCHOST_CONF25_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF25_S  8
/** SLCHOST_SLCHOST_CONF26 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF26    0x000000FFU
#define SLCHOST_SLCHOST_CONF26_M  (SLCHOST_SLCHOST_CONF26_V << SLCHOST_SLCHOST_CONF26_S)
#define SLCHOST_SLCHOST_CONF26_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF26_S  16
/** SLCHOST_SLCHOST_CONF27 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF27    0x000000FFU
#define SLCHOST_SLCHOST_CONF27_M  (SLCHOST_SLCHOST_CONF27_V << SLCHOST_SLCHOST_CONF27_S)
#define SLCHOST_SLCHOST_CONF27_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF27_S  24

/** SLCHOST_CONF_W7_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_W7_REG (DR_REG_SLCHOST_BASE + 0x8c)
/** SLCHOST_SLCHOST_CONF28 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF28    0x000000FFU
#define SLCHOST_SLCHOST_CONF28_M  (SLCHOST_SLCHOST_CONF28_V << SLCHOST_SLCHOST_CONF28_S)
#define SLCHOST_SLCHOST_CONF28_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF28_S  0
/** SLCHOST_SLCHOST_CONF29 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF29    0x000000FFU
#define SLCHOST_SLCHOST_CONF29_M  (SLCHOST_SLCHOST_CONF29_V << SLCHOST_SLCHOST_CONF29_S)
#define SLCHOST_SLCHOST_CONF29_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF29_S  8
/** SLCHOST_SLCHOST_CONF30 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF30    0x000000FFU
#define SLCHOST_SLCHOST_CONF30_M  (SLCHOST_SLCHOST_CONF30_V << SLCHOST_SLCHOST_CONF30_S)
#define SLCHOST_SLCHOST_CONF30_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF30_S  16
/** SLCHOST_SLCHOST_CONF31 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF31    0x000000FFU
#define SLCHOST_SLCHOST_CONF31_M  (SLCHOST_SLCHOST_CONF31_V << SLCHOST_SLCHOST_CONF31_S)
#define SLCHOST_SLCHOST_CONF31_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF31_S  24

/** SLCHOST_PKT_LEN0_REG register
 *  *******Description***********
 */
#define SLCHOST_PKT_LEN0_REG (DR_REG_SLCHOST_BASE + 0x90)
/** SLCHOST_HOSTSLCHOST_SLC0_LEN0 : RO; bitpos: [19:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_HOSTSLCHOST_SLC0_LEN0    0x000FFFFFU
#define SLCHOST_HOSTSLCHOST_SLC0_LEN0_M  (SLCHOST_HOSTSLCHOST_SLC0_LEN0_V << SLCHOST_HOSTSLCHOST_SLC0_LEN0_S)
#define SLCHOST_HOSTSLCHOST_SLC0_LEN0_V  0x000FFFFFU
#define SLCHOST_HOSTSLCHOST_SLC0_LEN0_S  0
/** SLCHOST_HOSTSLCHOST_SLC0_LEN0_CHECK : RO; bitpos: [31:20]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_HOSTSLCHOST_SLC0_LEN0_CHECK    0x00000FFFU
#define SLCHOST_HOSTSLCHOST_SLC0_LEN0_CHECK_M  (SLCHOST_HOSTSLCHOST_SLC0_LEN0_CHECK_V << SLCHOST_HOSTSLCHOST_SLC0_LEN0_CHECK_S)
#define SLCHOST_HOSTSLCHOST_SLC0_LEN0_CHECK_V  0x00000FFFU
#define SLCHOST_HOSTSLCHOST_SLC0_LEN0_CHECK_S  20

/** SLCHOST_PKT_LEN1_REG register
 *  *******Description***********
 */
#define SLCHOST_PKT_LEN1_REG (DR_REG_SLCHOST_BASE + 0x94)
/** SLCHOST_HOSTSLCHOST_SLC0_LEN1 : RO; bitpos: [19:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_HOSTSLCHOST_SLC0_LEN1    0x000FFFFFU
#define SLCHOST_HOSTSLCHOST_SLC0_LEN1_M  (SLCHOST_HOSTSLCHOST_SLC0_LEN1_V << SLCHOST_HOSTSLCHOST_SLC0_LEN1_S)
#define SLCHOST_HOSTSLCHOST_SLC0_LEN1_V  0x000FFFFFU
#define SLCHOST_HOSTSLCHOST_SLC0_LEN1_S  0
/** SLCHOST_HOSTSLCHOST_SLC0_LEN1_CHECK : RO; bitpos: [31:20]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_HOSTSLCHOST_SLC0_LEN1_CHECK    0x00000FFFU
#define SLCHOST_HOSTSLCHOST_SLC0_LEN1_CHECK_M  (SLCHOST_HOSTSLCHOST_SLC0_LEN1_CHECK_V << SLCHOST_HOSTSLCHOST_SLC0_LEN1_CHECK_S)
#define SLCHOST_HOSTSLCHOST_SLC0_LEN1_CHECK_V  0x00000FFFU
#define SLCHOST_HOSTSLCHOST_SLC0_LEN1_CHECK_S  20

/** SLCHOST_PKT_LEN2_REG register
 *  *******Description***********
 */
#define SLCHOST_PKT_LEN2_REG (DR_REG_SLCHOST_BASE + 0x98)
/** SLCHOST_HOSTSLCHOST_SLC0_LEN2 : RO; bitpos: [19:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_HOSTSLCHOST_SLC0_LEN2    0x000FFFFFU
#define SLCHOST_HOSTSLCHOST_SLC0_LEN2_M  (SLCHOST_HOSTSLCHOST_SLC0_LEN2_V << SLCHOST_HOSTSLCHOST_SLC0_LEN2_S)
#define SLCHOST_HOSTSLCHOST_SLC0_LEN2_V  0x000FFFFFU
#define SLCHOST_HOSTSLCHOST_SLC0_LEN2_S  0
/** SLCHOST_HOSTSLCHOST_SLC0_LEN2_CHECK : RO; bitpos: [31:20]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_HOSTSLCHOST_SLC0_LEN2_CHECK    0x00000FFFU
#define SLCHOST_HOSTSLCHOST_SLC0_LEN2_CHECK_M  (SLCHOST_HOSTSLCHOST_SLC0_LEN2_CHECK_V << SLCHOST_HOSTSLCHOST_SLC0_LEN2_CHECK_S)
#define SLCHOST_HOSTSLCHOST_SLC0_LEN2_CHECK_V  0x00000FFFU
#define SLCHOST_HOSTSLCHOST_SLC0_LEN2_CHECK_S  20

/** SLCHOST_CONF_W8_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_W8_REG (DR_REG_SLCHOST_BASE + 0x9c)
/** SLCHOST_SLCHOST_CONF32 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF32    0x000000FFU
#define SLCHOST_SLCHOST_CONF32_M  (SLCHOST_SLCHOST_CONF32_V << SLCHOST_SLCHOST_CONF32_S)
#define SLCHOST_SLCHOST_CONF32_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF32_S  0
/** SLCHOST_SLCHOST_CONF33 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF33    0x000000FFU
#define SLCHOST_SLCHOST_CONF33_M  (SLCHOST_SLCHOST_CONF33_V << SLCHOST_SLCHOST_CONF33_S)
#define SLCHOST_SLCHOST_CONF33_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF33_S  8
/** SLCHOST_SLCHOST_CONF34 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF34    0x000000FFU
#define SLCHOST_SLCHOST_CONF34_M  (SLCHOST_SLCHOST_CONF34_V << SLCHOST_SLCHOST_CONF34_S)
#define SLCHOST_SLCHOST_CONF34_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF34_S  16
/** SLCHOST_SLCHOST_CONF35 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF35    0x000000FFU
#define SLCHOST_SLCHOST_CONF35_M  (SLCHOST_SLCHOST_CONF35_V << SLCHOST_SLCHOST_CONF35_S)
#define SLCHOST_SLCHOST_CONF35_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF35_S  24

/** SLCHOST_CONF_W9_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_W9_REG (DR_REG_SLCHOST_BASE + 0xa0)
/** SLCHOST_SLCHOST_CONF36 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF36    0x000000FFU
#define SLCHOST_SLCHOST_CONF36_M  (SLCHOST_SLCHOST_CONF36_V << SLCHOST_SLCHOST_CONF36_S)
#define SLCHOST_SLCHOST_CONF36_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF36_S  0
/** SLCHOST_SLCHOST_CONF37 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF37    0x000000FFU
#define SLCHOST_SLCHOST_CONF37_M  (SLCHOST_SLCHOST_CONF37_V << SLCHOST_SLCHOST_CONF37_S)
#define SLCHOST_SLCHOST_CONF37_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF37_S  8
/** SLCHOST_SLCHOST_CONF38 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF38    0x000000FFU
#define SLCHOST_SLCHOST_CONF38_M  (SLCHOST_SLCHOST_CONF38_V << SLCHOST_SLCHOST_CONF38_S)
#define SLCHOST_SLCHOST_CONF38_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF38_S  16
/** SLCHOST_SLCHOST_CONF39 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF39    0x000000FFU
#define SLCHOST_SLCHOST_CONF39_M  (SLCHOST_SLCHOST_CONF39_V << SLCHOST_SLCHOST_CONF39_S)
#define SLCHOST_SLCHOST_CONF39_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF39_S  24

/** SLCHOST_CONF_W10_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_W10_REG (DR_REG_SLCHOST_BASE + 0xa4)
/** SLCHOST_SLCHOST_CONF40 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF40    0x000000FFU
#define SLCHOST_SLCHOST_CONF40_M  (SLCHOST_SLCHOST_CONF40_V << SLCHOST_SLCHOST_CONF40_S)
#define SLCHOST_SLCHOST_CONF40_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF40_S  0
/** SLCHOST_SLCHOST_CONF41 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF41    0x000000FFU
#define SLCHOST_SLCHOST_CONF41_M  (SLCHOST_SLCHOST_CONF41_V << SLCHOST_SLCHOST_CONF41_S)
#define SLCHOST_SLCHOST_CONF41_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF41_S  8
/** SLCHOST_SLCHOST_CONF42 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF42    0x000000FFU
#define SLCHOST_SLCHOST_CONF42_M  (SLCHOST_SLCHOST_CONF42_V << SLCHOST_SLCHOST_CONF42_S)
#define SLCHOST_SLCHOST_CONF42_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF42_S  16
/** SLCHOST_SLCHOST_CONF43 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF43    0x000000FFU
#define SLCHOST_SLCHOST_CONF43_M  (SLCHOST_SLCHOST_CONF43_V << SLCHOST_SLCHOST_CONF43_S)
#define SLCHOST_SLCHOST_CONF43_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF43_S  24

/** SLCHOST_CONF_W11_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_W11_REG (DR_REG_SLCHOST_BASE + 0xa8)
/** SLCHOST_SLCHOST_CONF44 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF44    0x000000FFU
#define SLCHOST_SLCHOST_CONF44_M  (SLCHOST_SLCHOST_CONF44_V << SLCHOST_SLCHOST_CONF44_S)
#define SLCHOST_SLCHOST_CONF44_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF44_S  0
/** SLCHOST_SLCHOST_CONF45 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF45    0x000000FFU
#define SLCHOST_SLCHOST_CONF45_M  (SLCHOST_SLCHOST_CONF45_V << SLCHOST_SLCHOST_CONF45_S)
#define SLCHOST_SLCHOST_CONF45_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF45_S  8
/** SLCHOST_SLCHOST_CONF46 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF46    0x000000FFU
#define SLCHOST_SLCHOST_CONF46_M  (SLCHOST_SLCHOST_CONF46_V << SLCHOST_SLCHOST_CONF46_S)
#define SLCHOST_SLCHOST_CONF46_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF46_S  16
/** SLCHOST_SLCHOST_CONF47 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF47    0x000000FFU
#define SLCHOST_SLCHOST_CONF47_M  (SLCHOST_SLCHOST_CONF47_V << SLCHOST_SLCHOST_CONF47_S)
#define SLCHOST_SLCHOST_CONF47_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF47_S  24

/** SLCHOST_CONF_W12_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_W12_REG (DR_REG_SLCHOST_BASE + 0xac)
/** SLCHOST_SLCHOST_CONF48 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF48    0x000000FFU
#define SLCHOST_SLCHOST_CONF48_M  (SLCHOST_SLCHOST_CONF48_V << SLCHOST_SLCHOST_CONF48_S)
#define SLCHOST_SLCHOST_CONF48_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF48_S  0
/** SLCHOST_SLCHOST_CONF49 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF49    0x000000FFU
#define SLCHOST_SLCHOST_CONF49_M  (SLCHOST_SLCHOST_CONF49_V << SLCHOST_SLCHOST_CONF49_S)
#define SLCHOST_SLCHOST_CONF49_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF49_S  8
/** SLCHOST_SLCHOST_CONF50 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF50    0x000000FFU
#define SLCHOST_SLCHOST_CONF50_M  (SLCHOST_SLCHOST_CONF50_V << SLCHOST_SLCHOST_CONF50_S)
#define SLCHOST_SLCHOST_CONF50_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF50_S  16
/** SLCHOST_SLCHOST_CONF51 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_CONF51    0x000000FFU
#define SLCHOST_SLCHOST_CONF51_M  (SLCHOST_SLCHOST_CONF51_V << SLCHOST_SLCHOST_CONF51_S)
#define SLCHOST_SLCHOST_CONF51_V  0x000000FFU
#define SLCHOST_SLCHOST_CONF51_S  24

